Revit 2027 API
ParameterTypeId.BoundaryParamPresetLinear Property
 "State"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryParamPresetLinear { get; }
Public Shared ReadOnly Property BoundaryParamPresetLinear As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryParamPresetLinear {
	ForgeTypeId^ get ();
}
static member BoundaryParamPresetLinear : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace